Repository: carmenbianca/protokolo
Catalog: po/*.po
Languages: nl, ta

source: Level {level} must be positive.
nl: Niveau {level} moet positief zijn.
ta: நிலை {level} நேர்மறையாக இருக்க வேண்டும்.

source: Title cannot be empty.
nl: title kan niet leeg zijn.
ta: தலைப்பு காலியாக இருக்க முடியாது.

source: Heading level {level} is too deep.
nl: Kopniveau {level} is te diep.
ta: தலைப்பு நிலை {level} மிகவும் ஆழமானது.

source: %(prog)s, version %(version)s
nl: %(prog)s, versie %(version)s
ta: %(prog)s, பதிப்பு %(version)s

source: This program is free software licensed under the European Union Public Licence, version 1.2 or later.
ta: இந்த திட்டம் ஐரோப்பிய ஒன்றிய பொது உரிமம், பதிப்பு 1.2 அல்லது அதற்குப் பிறகு உரிமம் பெற்ற இலவச மென்பொருள்.

source: Written by Carmen Bianca BAKKER.
nl: Geschreven door Carmen Bianca BAKKER.
ta: கார்மென் பியான்கா சரிவுகளால் எழுதப்பட்டது.

source: Protokolo is a change log generator.
nl: Protokolo is een changelog-generator.
ta: நெறிமுறை ஒரு சேஞ்ச்லாக் செனரேட்டர்.

source: Protokolo allows you to maintain your change log fragments in separate files, and then finally aggregate them into a new section in CHANGELOG just before release.
nl: Protokolo zorgt ervoor dat je jouw changelogfragmenten in aparte bestanden kunt plaatsen, om ze vervolgens te aggregeren naar een nieuwe sectie in CHANGELOG vlak voor een nieuwe uitgave.
ta: புரோட்டோகோலோ உங்கள் மாற்ற பதிவு துண்டுகளை தனித்தனி கோப்புகளில் பராமரிக்க உங்களை அனுமதிக்கிறது, பின்னர் இறுதியாக அவற்றை வெளியிடுவதற்கு முன்பு சேஞ்ச்லோக்கில் ஒரு புதிய பிரிவில் திரட்டுகிறது.

source: Aggregate all change log fragments into a change log file. The fragments are gathered from a change log directory, and subsequently deleted.
nl: Voeg alle changelogfragmenten samen in een changelogbestand. De fragmenten worden verzameld in een changelogmap en vervolgens verwijderd.
ta: அனைத்து மாற்ற பதிவு துண்டுகளையும் மாற்ற பதிவு கோப்பில் திரட்டவும். துண்டுகள் ஒரு மாற்ற பதிவு கோப்பகத்திலிருந்து சேகரிக்கப்பட்டு பின்னர் நீக்கப்படும்.

source: determined by config
nl: bepaald door configuratie
ta: கட்டமைப்பால் தீர்மானிக்கப்படுகிறது

source: File into which to compile.
nl: Bestand waarnaar gecompileerd moet worden.
ta: தொகுக்க வேண்டிய கோப்பு.

source: Change log directory to compile.
nl: Changelogmap om te compileren.
ta: தொகுக்க பதிவு கோப்பகத்தை மாற்றவும்.

source: determined by config, or markdown
nl: bepaald door configuratie, of markdown
ta: கட்டமைப்பு அல்லது மார்க் பேரூர் மூலம் தீர்மானிக்கப்படுகிறது

source: Markup language.
nl: Markup-taal.
ta: மார்க்அப் மொழி.

source: Use key-value pairs to string-format section headings.
nl: Gebruik sleutel/waarde-paren om sectiekoppen te string-formatteren.
ta: சரம் வடிவ பிரிவு தலைப்புகளுக்கு முக்கிய மதிப்பு சோடிகளைப் பயன்படுத்தவும்.

source: Do not write to file system; print result to STDOUT.
nl: Schrijf niet naar bestandssysteem; print resultaat naar STDOUT.
ta: கோப்பு முறைமைக்கு எழுத வேண்டாம்; முடிவை stdout க்கு அச்சிடுக.

source: There are no change log fragments to compile.
nl: Er zijn geen changelogfragmenten om te compileren.
ta: தொகுக்க எந்த மாற்ற பதிவு துண்டுகளும் இல்லை.

source: There is no 'protokolo-section-tag' in {path}.
nl: Er is geen 'protokolo-section-tag' in {path}.
ta: {path}இல் 'புரோட்டோகோலோ-பிரிவு-டேக்' இல்லை.

source: Set up your project to be ready to use Protokolo. It creates a change log file, a change log directory with subsections that match the Keep a Changelog recommendations, and a root .protokolo.toml file with defaults for subsequent Protokolo commands.
nl: Maak je project klaar voor gebruik van Protokolo. Het maakt een changelogbestaand, een changelogmap met subsecties volgens de Keep a Changelog-aanbevelingen, en een root .protokolo.toml-bestand met standaardwaardes voor subsequente Protokolo-commando's aan.
ta: புரோட்டோகோலோவைப் பயன்படுத்த தயாராக இருக்க உங்கள் திட்டத்தை அமைக்கவும். இது ஒரு மாற்ற பதிவு கோப்பு, சேஞ்ச்லாக் பரிந்துரைகளுடன் பொருந்தக்கூடிய துணைப்பிரிவுகளுடன் மாற்ற பதிவு அடைவு மற்றும் அடுத்தடுத்த புரோட்டோகோலோ கட்டளைகளுக்கான இயல்புநிலைகளுடன் .protokolo.toml கோப்பு ஆகியவற்றை உருவாக்குகிறது.

source: Files that already exist are never overwritten, except the root .protokolo.toml file, which is always (re-)generated.
nl: Bestanden die al bestaan worden nooit overschreven, behalve het root .protokolo.toml-bestand, die altijd (opnieuw) gegenereerd wordt.
ta: ஏற்கனவே இருக்கும் கோப்புகள் ஒருபோதும் மேலெழுதப்படவில்லை, ரூட் தவிர .protokolo.toml கோப்பு, இது எப்போதும் (மறு) உருவாக்கப்படுகிறது.

source: determined by config, or CHANGELOG.md
nl: bepaald door configuratie, of CHANGELOG.md
ta: CONFIG, அல்லது Changelog.md ஆல் தீர்மானிக்கப்படுகிறது

source: Change log file to create.
nl: Changelogbestand om aan te maken.
ta: உருவாக்க பதிவு கோப்பை மாற்றவும்.

source: determined by config, or changelog.d
nl: bepaald door configuratie, of changelog.d
ta: CONFIG, அல்லது Changelog.D ஆல் தீர்மானிக்கப்படுகிறது

source: Change log directory to create.
nl: Changelogmap om aan te maken.
ta: உருவாக்க பதிவு கோப்பகத்தை மாற்றவும்.

source: Invalid TOML in {file_name}: {error}
nl: Ongeldige TOML in {file_name}: {error}
ta: {file_name}: {error} இல் தவறான டாம்ல்

source: Wrong value in {file_name}: {error}
nl: Foute waarde in {file_name}: {error}
ta: {file_name}: {error}

source: Failed to format section heading of {source}: {error}
nl: Gefaald om sectiekop van {source} te formatteren: {error}
ta: {source}: {error} இன் பிரிவு தலைப்பை வடிவமைக்கத் தவறிவிட்டது

source: TOML must be a str or IO[bytes]
nl: TOML moet een str of IO[bytes] zijn
ta: டாம்ல் ஒரு str அல்லது io [பைட்டுகள்] ஆக இருக்க வேண்டும்

source: level must be a positive integer, got {level}
nl: level moet een positieve integer zijn, kreeg {level}
ta: நிலை ஒரு நேர்மறையான முழு எண்ணாக இருக்க வேண்டும், கிடைத்தது {level}

source: order must be None or a positive integer, got {order}
nl: order moet None of een positieve integer zijn, kreeg {order}
ta: ஆர்டர் எதுவும் இல்லை அல்லது நேர்மறையான முழு எண்ணாக இருக்க வேண்டும், {order} கிடைத்தது

source: Function takes no more than 4 arguments ({args_count} given)
nl: Functie neemt niet meer dan 4 argumenten ({args_count} gekregen)
ta: செயல்பாடு 4 வாதங்களுக்கு மேல் தேவையில்லை ({args_count} கொடுக்கப்பட்டுள்ளது)

source: Expected a type, got {type}
nl: Verwachtte een type, kreeg {type}
ta: ஒரு வகை எதிர்பார்க்கப்படுகிறது, {type} கிடைத்தது

source: Expected {name}.
nl: Verwachtte {name}.
ta: எதிர்பார்க்கப்படுகிறது {name}.

source: Got {value}.
nl: Kreeg {value}.
ta: {value} கிடைத்தது.

source: '{key}' does not have the correct type.
nl: '{key}' heeft niet het juiste type.
ta: '{key}' சரியான வகை இல்லை.

source: List '{key}' contains an element with the wrong type.
nl: Lijst '{key}' bevat een element met het verkeerde type.
ta: '{key}' இல் தவறான வகையுடன் ஒரு உறுப்பு உள்ளது.

source: {editor}: Editing failed
nl: {editor}: Tekstverwerking gefaald
ta: {editor}: திருத்துதல் தோல்வியடைந்தது

source: {editor}: Editing failed: {e}
nl: {editor}: Tekverwerking gefaald: {e}
ta: {editor}: திருத்துதல் தோல்வியுற்றது: {e}

source: Options
nl: Opties
ta: விருப்பங்கள்

source: Got unexpected extra argument ({args})
nl: Kreeg onverwacht extra argument ({args})
ta: எதிர்பாராத கூடுதல் உரையாடல் கிடைத்தது ({args})

source: Aborted!
nl: Afgebroken!
ta: கருக்கலைப்பு!

source: Commands
nl: Commando's
ta: கட்டளைகள்

source: Missing command.
nl: Missend commando.
ta: கட்டளை இல்லை.

source: No such command {name!r}.
nl: Geen commando {name!r}.
ta: அத்தகைய கட்டளை இல்லை {பெயர்! R}.

source: Value must be an iterable.
nl: Waarde moet iterabel zijn.
ta: மதிப்பு ஒரு கடுமையாக இருக்க வேண்டும்.

source: Takes {nargs} values but 1 was given.
nl: Neemt {nargs} waardes, maar kreeg 1.
ta: {nargs} மதிப்புகளை எடுத்துக்கொள்கிறது, ஆனால் 1 வழங்கப்பட்டது.

source: env var: {var}
ta: Env இருந்தது: {var}

source: default: {default}
nl: standaard: {default}
ta: இயல்புநிலை: {default}

source: (dynamic)
nl: (dynamisch)
ta: (மாறும்)

source: Show the version and exit.
nl: Laat de versie zien en sluit af.
ta: பதிப்பைக் காட்டி வெளியேறவும்.

source: Show this message and exit.
nl: Laat dit bericht zien en sluit af.
ta: இந்த செய்தியைக் காட்டி வெளியேறவும்.

source: Error: {message}
nl: Fout: {message}
ta: பிழை: {message}

source: Try '{command} {option}' for help.
nl: Probeer '{command} {option}' voor hulp.
ta: உதவிக்கு '{command} {option}' முயற்சிக்கவும்.

source: Invalid value: {message}
nl: Ongeldige waarde: {message}
ta: தவறான மதிப்பு: {message}

source: Invalid value for {param_hint}: {message}
nl: Ongeldige waarde voor {param_hint}: {message}
ta: {param_hint}: {message}

source: Missing argument
nl: Missend argument
ta: காணாமல் போன உரையாடல்

source: Missing option
nl: Missende optie
ta: விருப்பம் இல்லை

source: Missing parameter
nl: Missende parameter
ta: இல்லை அளவுரு

source: Missing {param_type}
nl: Missende {param_type}
ta: காணவில்லை {param_type}

source: Missing parameter: {param_name}
nl: Missende parameter: {param_name}
ta: காணாமல் போன அளவுரு: {param_name}

source: No such option: {name}
nl: Optie bestaat niet: {name}
ta: அத்தகைய விருப்பம் இல்லை: {name}

source: Did you mean {possibility}?
nl: Bedoelde je {possibility}?
ta: நீங்கள் {possibility} என்று சொன்னீர்களா?

source: unknown error
nl: onbekende fout
ta: தெரியாத பிழை

source: Could not open file {filename!r}: {message}
nl: Kon {filename!r} niet openen: {message}
ta: கோப்பைத் திறக்க முடியவில்லை {கோப்பு பெயர்! R}: {message}

source: Argument {name!r} takes {nargs} values.
nl: Argument {name!r} neemt {nargs} waardes.
ta: உரையாடல் {பெயர்! R} {nargs} மதிப்புகளை எடுக்கிறது.

source: Option {name!r} does not take a value.
nl: Optie {name!r} neemt geen waarde.
ta: விருப்பம் {பெயர்! R} ஒரு மதிப்பை எடுக்காது.

source: Option {name!r} requires an argument.
nl: Optie {name!r} heeft een argument nodig.
ta: விருப்பம் {பெயர்! R} ஒரு உரையாடல் தேவை.

source: Shell completion is not supported for Bash versions older than 4.4.
ta: 4.4 ஐ விட பழைய பாச் பதிப்புகளுக்கு செல் நிறைவு ஆதரிக்கப்படவில்லை.

source: Couldn't detect Bash version, shell completion is not supported.
ta: பாச் பதிப்பைக் கண்டறிய முடியவில்லை, செல் நிறைவு ஆதரிக்கப்படவில்லை.

source: Repeat for confirmation
nl: Herhaal ter bevestiging
ta: உறுதிப்படுத்த மீண்டும் செய்யவும்

source: Error: The value you entered was invalid.
nl: Fout: De waarde die je invoerde was ongeldig.
ta: பிழை: நீங்கள் உள்ளிட்ட மதிப்பு தவறானது.

source: Error: {e.message}
nl: Foutmelding: {e.message}
ta: பிழை: {e.message}

source: Error: The two entered values do not match.
nl: Foutmelding: De twee ingevoerde waardes zijn niet gelijk.
ta: பிழை: உள்ளிட்ட இரண்டு மதிப்புகள் பொருந்தவில்லை.

source: Error: invalid input
nl: Foutmelding: ongeldige invoer
ta: பிழை: தவறான உள்ளீடு

source: Press any key to continue...
nl: Druk op een willekeurige toets om verder te gaan...
ta: தொடர எந்த விசையையும் அழுத்தவும் ...

source: Choose from: {choices}
nl: Kies uit: {choices}
ta: இதிலிருந்து தேர்வுசெய்க: {choices}

source: {value!r} is not {choice}.
nl: {value!r} is niet {choice}.
ta: {மதிப்பு! r} என்பது {தேர்வு அல்ல.

source: {value!r} does not match the format {format}.
nl: {value!r} komt niet overeen met het formaat {format}.
ta: {மதிப்பு! r} வடிவத்துடன் {வடிவமைப்பு with உடன் பொருந்தவில்லை.

source: {value!r} is not a valid {number_type}.
nl: {value!r} is geen geldige {number_type}.
ta: {மதிப்பு! r} என்பது செல்லுபடியாகும் {number_type}.

source: {value} is not in the range {range}.
nl: {value} is niet in het bereik {range}.
ta: {value} வரம்பில் {range} இல்லை.

source: {value!r} is not a valid UUID.
nl: {value!r} is geen geldige UUID.
ta: {மதிப்பு! r} என்பது சரியான UUID அல்ல.

source: file
nl: bestand
ta: கோப்பு

source: directory
nl: map
ta: அடைவு

source: path
nl: pad
ta: பாதை

source: {name} {filename!r} does not exist.
nl: {name} {filename!r} bestaat niet.
ta: {name} {கோப்பு பெயர்! r} இல்லை.

source: {name} {filename!r} is a file.
nl: {name} {filename!r} is een bestand.
ta: {name} {கோப்பு பெயர்! r} என்பது ஒரு கோப்பு.

source: {name} {filename!r} is not readable.
nl: {name} {filename!r} is niet leesbaar.
ta: {name} {கோப்பு பெயர்! r} படிக்க முடியாது.

source: {name} {filename!r} is not writable.
nl: {name} {filename!r} is niet schrijfbaar.
ta: {name} {கோப்பு பெயர்! r} எழுதக்கூடியது அல்ல.

source: {name} {filename!r} is not executable.
nl: {name} {filename!r} is niet uitvoerbaar.
ta: {name} {கோப்பு பெயர்! r} இயங்க முடியாது.

source: {len_type} values are required, but {len_value} was given.
nl: {len_type} waardes zijn benodigd, maar {len_value} was gegeven.
ta: {len_type} மதிப்புகள் தேவை, ஆனால் {len_value} கொடுக்கப்பட்டது.
